arm-gcc-bin@8
autoconf
automake
avr-binutils
avr-gcc@8
avrdude
awk
bat
bdw-gc
boost
bootloadhid
brotli
c-ares
ca-certificates
cairo
clang-format
cmake
confuse
coreutils
dfu-programmer
dfu-util
duf
dust
emacs-plus@30
exa
fish
fontconfig
freetype
fribidi
fzf
gdk-pixbuf
gettext
ghostscript
giflib
glib
gmp
gnu-getopt
gnu-sed
gnu-tar
gnupg
gnutls
graphite2
grep
guile
harfbuzz
hidapi
htop
icu4c
isl
ispell
jansson
jbig2dec
jpeg-turbo
jq
lazygit
libassuan
libevent
libftdi
libgcrypt
libgit2
libgpg-error
libidn
libidn2
libimagequant
libksba
libmpc
libnghttp2
libpng
libraqm
librsvg
libssh2
libtasn1
libtermkey
libtiff
libtool
libunistring
libusb
libusb-compat
libuv
libvterm
libx11
libxau
libxcb
libxdmcp
libxext
libxrender
little-cms2
llvm
lpeg
lua
lua-language-server
luajit
luarocks
luv
lz4
lzo
m4
make
marked
mdloader
mpdecimal
mpfr
msgpack
ncurses
neovide
neovim
nettle
node
npth
oniguruma
openjpeg
openldap
openssl@1.1
openssl@3
p11-kit
pandoc
pango
pass
pcre
pcre2
pillow
pinentry
pixman
pkg-config
procs
pyenv
python@3.11
qmk
qrencode
readline
rust
six
skhd
sqlite
starship
tcl-tk
teensy_loader_cli
texinfo
thefuck
tree
tree-sitter
unbound
unibilium
webp
wget
wimlib
xorgproto
xz
yabai
z3
zoxide
zsh
zstd
amethyst
espanso
font-3270-nerd-font
font-agave-nerd-font
font-anonymice-nerd-font
font-arimo-nerd-font
font-aurulent-nerd-font
font-bigblue-terminal-nerd-font
font-bitstream-vera-sans-mono-nerd-font
font-blex-mono-nerd-font
font-caskaydia-cove-nerd-font
font-code-new-roman-nerd-font
font-comic-shanns-mono-nerd-font
font-cousine-nerd-font
font-daddy-time-mono-nerd-font
font-dejavu-sans-mono-nerd-font
font-droid-sans-mono-nerd-font
font-envy-code-r-nerd-font
font-fantasque-sans-mono-nerd-font
font-fira-code-nerd-font
font-fira-mono-nerd-font
font-go-mono-nerd-font
font-gohufont-nerd-font
font-hack-nerd-font
font-hasklug-nerd-font
font-heavy-data-nerd-font
font-hurmit-nerd-font
font-im-writing-nerd-font
font-inconsolata-go-nerd-font
font-inconsolata-lgc-nerd-font
font-inconsolata-nerd-font
font-intone-mono-nerd-font
font-iosevka-nerd-font
font-iosevka-term-nerd-font
font-jetbrains-mono-nerd-font
font-lekton-nerd-font
font-liberation-nerd-font
font-lilex-nerd-font
font-meslo-lg-nerd-font
font-monocraft-nerd-font
font-monofur-nerd-font
font-monoid-nerd-font
font-mononoki-nerd-font
font-mplus-nerd-font
font-noto-nerd-font
font-open-dyslexic-nerd-font
font-overpass-nerd-font
font-profont-nerd-font
font-proggy-clean-tt-nerd-font
font-roboto-mono-nerd-font
font-sauce-code-pro-nerd-font
font-shure-tech-mono-nerd-font
font-space-mono-nerd-font
font-symbols-only-nerd-font
font-terminess-ttf-nerd-font
font-tinos-nerd-font
font-ubuntu-mono-nerd-font
font-ubuntu-nerd-font
font-victor-mono-nerd-font
mactex
wezterm
