jorgebucaran/fisher
ilancosman/tide@v5
gazorby/fish-abbreviation-tips
joseluisq/gitnow@2.10.0
jorgebucaran/nvm.fish
franciscolourenco/done
gazorby/fish-exa
oh-my-fish/plugin-pj
patrickf1/fzf.fish
